In [14]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

# Series

In [3]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
obj2['a']

-5

In [11]:
obj2[['a', 'b', 'c']]

a   -5
b    7
c    3
dtype: int64

In [12]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [13]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [15]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
'b' in obj2

True

In [17]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}

In [18]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [19]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [20]:
obj4 = pd.Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [21]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [24]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
obj3 + obj4
# automatic alignment of index labels

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [28]:
obj4.name = 'population'

In [31]:
obj.index.name = 'state'

In [32]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [33]:
obj

state
0    4
1    7
2   -5
3    3
dtype: int64

In [34]:
obj.index = ['bob', 'steve', 'jeff', 'ryan']
obj

bob      4
steve    7
jeff    -5
ryan     3
dtype: int64

# DataFrame

In [37]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [40]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [41]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [42]:
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [44]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [45]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [46]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [47]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [48]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [50]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [51]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
frame2['dept'] = val
frame2

       year   state  pop  debt  dept
one    2000    Ohio  1.5   0.0   NaN
two    2001    Ohio  1.7   1.0  -1.2
three  2002    Ohio  3.6   2.0   NaN
four   2001  Nevada  2.4   3.0  -1.5
five   2002  Nevada  2.9   4.0  -1.7
six    2003  Nevada  3.2   5.0   NaN

In [52]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  dept  eastern
one    2000    Ohio  1.5   0.0   NaN     True
two    2001    Ohio  1.7   1.0  -1.2     True
three  2002    Ohio  3.6   2.0   NaN     True
four   2001  Nevada  2.4   3.0  -1.5    False
five   2002  Nevada  2.9   4.0  -1.7    False
six    2003  Nevada  3.2   5.0   NaN    False

In [53]:
del frame2['eastern']

In [54]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'dept'], dtype='object')

In [55]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [56]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [57]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [58]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [59]:
pd.DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [60]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [62]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [63]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [64]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [65]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [66]:
frame2.values

array([[2000, 'Ohio', 1.5, 0.0, nan],
       [2001, 'Ohio', 1.7, 1.0, -1.2],
       [2002, 'Ohio', 3.6, 2.0, nan],
       [2001, 'Nevada', 2.4, 3.0, -1.5],
       [2002, 'Nevada', 2.9, 4.0, -1.7],
       [2003, 'Nevada', 3.2, 5.0, nan]], dtype=object)

# Index Objects

In [67]:
obj = pd.Series(range(3), index = ['a', 'b', 'c'])

In [68]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [69]:
index[1:]

Index(['b', 'c'], dtype='object')

In [70]:
index[1] ='d'
# immutable

TypeError: Index does not support mutable operations

In [71]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [72]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [74]:
obj2.index is labels

True

In [75]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [76]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [77]:
2003 in frame3.index

False

In [78]:
# duplicate labels are possible
dup_labels =pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

# Reindexing

In [79]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [80]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [81]:
# reindexing with filling the values for nan
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [82]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [87]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index = ['a', 'c', 'd'], columns = ['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [88]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [89]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [90]:
frame.loc[['a', 'b', 'c', 'd'], states]

C:\Users\Aditya\Anaconda3\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

# Droping entries from axis

In [91]:
obj = pd.Series(np.arange(5.0), index = ['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [93]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [94]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [98]:
data = pd.DataFrame(np.arange(16).reshape((4, 4,)), index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [99]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [100]:
data.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [101]:
data.drop(['two', 'four'], axis = 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [102]:
# modify object in place without returning a new object
obj.drop('c', inplace = True)

In [103]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

# Indexing, Selecting and Filtering

In [104]:
obj = pd.Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [105]:
obj['b']

1.0

In [106]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [107]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [108]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [109]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [110]:
# end points are inclusive
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [111]:
obj['b':'c'] = 5

In [112]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [115]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                  columns = ['one','two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [116]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [118]:
data[['two', 'three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [119]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [121]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [122]:
# using boolean indexing
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [124]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [125]:
# using loc and iloc
data.loc['Colorado', ['two' ,'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [126]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [127]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [128]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [133]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [135]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

# Integer Indexes

In [136]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [137]:
ser[-1]

KeyError: -1

In [138]:
ser2 = pd.Series(np.arange(3.), index = ['a', 'b', 'c'])

In [139]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [140]:
ser2[-1]

2.0

In [141]:
ser[:1]

0    0.0
dtype: float64

In [142]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [143]:
ser.iloc[:1]

0    0.0
dtype: float64

# Arithmetic and Data Alignment

In [144]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [145]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [146]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [148]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns = list('bcd'), index = ['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [149]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [150]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [151]:
df1 = pd.DataFrame({'A': [1, 2]})
df1

   A
0  1
1  2

In [152]:
df2 = pd.DataFrame({'B': [3, 4]})
df2

   B
0  3
1  4

In [153]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

# Arithmetic Methods with fill values

In [157]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,  4)), columns = list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [159]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns = list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [162]:
df2.loc[1, 'b'] = np.nan

In [163]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [164]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [165]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [166]:
# using add method
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [167]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [168]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [169]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

# Operations between dataframe and series

In [170]:
arr = np.arange(12.).reshape((3,  4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [171]:
arr[0]

array([0., 1., 2., 3.])

In [172]:
arr-arr[0] # broadcasting

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [175]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns = list('bde'),
                    index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [177]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [178]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [179]:
series2 = pd.Series(range(3), index = ['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [180]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [183]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [184]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [182]:
frame.sub(series3, axis = 'index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

# Function Application and Mapping

In [186]:
frame = pd.DataFrame(np.random.randn(4, 3), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.089955  1.878293  0.263439
Ohio    0.854753 -1.024987  0.334982
Texas   0.066352  1.163210  1.172291
Oregon -1.320430 -0.431696  0.565756

In [187]:
np.abs(frame)

               b         d         e
Utah    0.089955  1.878293  0.263439
Ohio    0.854753  1.024987  0.334982
Texas   0.066352  1.163210  1.172291
Oregon  1.320430  0.431696  0.565756

In [188]:
f = lambda x: x.max() - x.min()

In [189]:
frame.apply(f)

b    2.175183
d    2.903280
e    0.908853
dtype: float64

In [190]:
frame.apply(f, axis = 'columns')

Utah      1.968248
Ohio      1.879740
Texas     1.105939
Oregon    1.886186
dtype: float64

In [191]:
def f(x):
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])
frame.apply(f)

            b         d         e
min -1.320430 -1.024987  0.263439
max  0.854753  1.878293  1.172291

In [192]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d     e
Utah    -0.09   1.88  0.26
Ohio     0.85  -1.02  0.33
Texas    0.07   1.16  1.17
Oregon  -1.32  -0.43  0.57

In [193]:
frame['e'].map(format)

Utah      0.26
Ohio      0.33
Texas     1.17
Oregon    0.57
Name: e, dtype: object

# Sorting and Ranking

In [195]:
obj = pd.Series(range(4), index = ['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [196]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [198]:
frame = pd.DataFrame(np.arange(8).reshape(2, 4), index = ['three', 'one'], columns = ['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [199]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [200]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [201]:
frame.sort_index(axis = 1, ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [202]:
obj = pd.Series([4, 7, -3, 2])

In [203]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [205]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [206]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [207]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [208]:
frame.sort_values(by = 'b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [210]:
# ranks
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [211]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [212]:
# rank according to which is observed first
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [213]:
obj.rank(ascending = False, method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [214]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [215]:
frame.rank(axis = 'columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

# Axis Indexes with duplicate labels

In [216]:
obj = pd.Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [217]:
obj.index.is_unique

False

In [218]:
# selection
obj['a']

a    0
a    1
dtype: int64

In [219]:
obj['c']

4

In [221]:
df = pd.DataFrame(np.random.randn(4, 3), index = ['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.597815 -0.280786  1.075524
a -0.592573 -0.346807 -1.555981
b  0.689105  0.305011 -1.433464
b -0.906036 -0.424433 -0.215754

In [222]:
df.loc['b']

          0         1         2
b  0.689105  0.305011 -1.433464
b -0.906036 -0.424433 -0.215754

# Summarizing and Computing Descriptive Statistics

In [223]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index = ['a', 'b', 'c', 'd'], columns = ['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [224]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [225]:
df.sum(axis = 'columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [226]:
df.mean(axis = 'columns', skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [227]:
df.idxmax() # maximum and minimum are attained

one    b
two    d
dtype: object

In [230]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [231]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [232]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [233]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [235]:
import pandas_datareader.data as web

In [236]:
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [238]:
all_data

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2009-12-31   30.478571   30.080000   30.447144   30.104286   88102700.0
 2010-01-04   30.642857   30.340000   30.490000   30.572857  123432400.0
 2010-01-05   30.798571   30.464285   30.657143   30.625713  150476200.0
 2010-01-06   30.747143   30.107143   30.625713   30.138571  138040000.0
 2010-01-07   30.285715   29.864286   30.250000   30.082857  119282800.0
 2010-01-08   30.285715   29.865715   30.042856   30.282858  111902700.0
 2010-01-11   30.428572   29.778572   30.400000   30.015715  115557400.0
 2010-01-12   29.967142   29.488571   29.884285   29.674286  148614900.0
 2010-01-13   30.132856   29.157143   29.695715   30.092857  151473000.0
 2010-01-14   30.065714   29.860001   30.015715   29.918571  108223500.0
 2010-01-15   30.228571   29.410000   30.132856   29.418571  148516900.0
 2010-01-19   30.741428   29.605715   29.761429   30.719999  182501900.0
 2010-01-20   30.792856   29.928572   30.701429   30.247143  153038200.0
 2010-01-21   30.472857   29.601429   30.297142   29.724285  152038600.0
 2010-01-22   29.642857   28.165714   29.540001   28.250000  220441900.0
 2010-01-25   29.242857   28.598572   28.930000   29.010000  266424900.0
 2010-01-26   30.530001   28.940001   29.421429   29.420000  466777500.0
 2010-01-27   30.082857   28.504286   29.549999   29.697144  430642100.0
 2010-01-28   29.357143   28.385714   29.275715   28.469999  293375600.0
 2010-01-29   28.885714   27.178572   28.725714   27.437143  311488100.0
 2010-02-01   28.000000   27.328571   27.481428   27.818571  187469100.0
 2010-02-02   28.045713   27.625713   27.987143   27.980000  174585600.0
 2010-02-03   28.600000   27.774286   27.881428   28.461428  153832000.0
 2010-02-04   28.338572   27.367144   28.104286   27.435715  189413000.0
 2010-02-05   28.000000   27.264286   27.518572   27.922857  212576700.0
 2010-02-08   28.268572   27.714285   27.955715   27.731428  119567700.0
 2010-02-09   28.214285   27.821428   28.059999   28.027143  158221700.0
 2010-02-10   28.085714   27.751429   27.984285   27.874287   92590400.0
 2010-02-11   28.535715   27.722857   27.840000   28.381428  137586400.0
 2010-02-12   28.805714   27.928572   28.301428   28.625713  163867200.0
 ...                ...         ...         ...         ...          ...
 2019-06-21  200.850006  198.149994  198.800003  198.779999   47800600.0
 2019-06-24  200.160004  198.169998  198.539993  198.580002   18220400.0
 2019-06-25  199.259995  195.289993  198.429993  195.570007   21070300.0
 2019-06-26  200.990005  197.350006  197.770004  199.800003   26067500.0
 2019-06-27  201.570007  199.570007  200.289993  199.740005   20899700.0
 2019-06-28  199.500000  197.050003  198.679993  197.919998   31110600.0
 2019-07-01  204.490005  200.649994  203.169998  201.550003   27316700.0
 2019-07-02  203.130005  201.360001  201.410004  202.729996   16935200.0
 2019-07-03  204.440002  202.690002  203.279999  204.410004   11362000.0
 2019-07-05  205.080002  202.899994  203.350006  204.229996   17265500.0
 2019-07-08  201.399994  198.410004  200.809998  200.020004   25338600.0
 2019-07-09  201.509995  198.809998  199.199997  201.240005   20578000.0
 2019-07-10  203.729996  201.559998  201.850006  203.229996   17897100.0
 2019-07-11  204.389999  201.710007  203.309998  201.750000   20191800.0
 2019-07-12  204.000000  202.199997  202.449997  203.300003   17595200.0
 2019-07-15  205.869995  204.000000  204.089996  205.210007   16947400.0
 2019-07-16  206.110001  203.500000  204.589996  204.500000   16866800.0
 2019-07-17  205.089996  203.270004  204.050003  203.350006   14107500.0
 2019-07-18  205.880005  203.699997  204.000000  205.660004   18582200.0
 2019-07-19  206.500000  202.360001  205.789993  202.589996   20929300.0
 2019-07-22  207.229996  203.610001  203.649994  207.220001   22277900.0
 2019-07-23  208.910004  207.289993  208.460007  208.839996   18355200.0
 2019-07-24  209.149994  207.169998  207.669998  208.669998   14991600.0
 2019-07-25  209.240005  206.729996  208.889999  207.020004   13909600.0
 2019-07-26  209.729996  207.139999  207.479996  207.740005   17618900.0
 2019-07-29  210.639999  208.440002  208.460007  209.679993   21673400.0
 2019-07-30  210.160004  207.309998  208.759995  208.779999   33935700.0
 2019-07-31  221.369995  211.300003  216.419998  213.039993   69281400.0
 2019-08-01  218.029999  206.740005  213.899994  208.429993   54017900.0
 2019-08-02  206.429993  201.630005  205.529999  204.020004   38688200.0

              Adj Close
 Date
 2009-12-31   26.372231
 2010-01-04   26.782711
 2010-01-05   26.829010
 2010-01-06   26.402260
 2010-01-07   26.353460
 2010-01-08   26.528664
 2010-01-11   26.294640
 2010-01-12   25.995537
 2010-01-13   26.362217
 2010-01-14   26.209538
 2010-01-15   25.771528
 2010-01-19   26.911612
 2010-01-20   26.497383
 2010-01-21   26.039341
 2010-01-22   24.747818
 2010-01-25   25.413599
 2010-01-26   25.772774
 2010-01-27   26.015560
 2010-01-28   24.940546
 2010-01-29   24.035734
 2010-02-01   24.369871
 2010-02-02   24.511295
 2010-02-03   24.933033
 2010-02-04   24.034487
 2010-02-05   24.461227
 2010-02-08   24.293537
 2010-02-09   24.552589
 2010-02-10   24.418684
 2010-02-11   24.862957
 2010-02-12   25.076958
 ...                ...
 2019-06-21  198.779999
 2019-06-24  198.580002
 2019-06-25  195.570007
 2019-06-26  199.800003
 2019-06-27  199.740005
 2019-06-28  197.919998
 2019-07-01  201.550003
 2019-07-02  202.729996
 2019-07-03  204.410004
 2019-07-05  204.229996
 2019-07-08  200.020004
 2019-07-09  201.240005
 2019-07-10  203.229996
 2019-07-11  201.750000
 2019-07-12  203.300003
 2019-07-15  205.210007
 2019-07-16  204.500000
 2019-07-17  203.350006
 2019-07-18  205.660004
 2019-07-19  202.589996
 2019-07-22  207.220001
 2019-07-23  208.839996
 2019-07-24  208.669998
 2019-07-25  207.020004
 2019-07-26  207.740005
 2019-07-29  209.679993
 2019-07-30  208.779999
 2019-07-31  213.039993
 2019-08-01  208.429993
 2019-08-02  204.020004

 [2413 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 2009-12-31  132.850006  130.750000  132.410004  130.899994   4223400.0
 2010-01-04  132.970001  130.850006  131.179993  132.449997   6155300.0
 2010-01-05  131.850006  130.100006  131.679993  130.850006   6841400.0
 2010-01-06  131.490005  129.809998  130.679993  130.000000   5605300.0
 2010-01-07  130.250000  128.910004  129.869995  129.550003   5840600.0
 2010-01-08  130.919998  129.050003  129.070007  130.850006   4197200.0
 2010-01-11  131.059998  128.669998  131.059998  129.479996   5730400.0
 2010-01-12  131.330002  129.000000  129.029999  130.509995   8081500.0
 2010-01-13  131.119995  129.160004  130.389999  130.229996   6455400.0
 2010-01-14  132.710007  129.910004  130.550003  132.309998   7111800.0
 2010-01-15  132.889999  131.089996  132.029999  131.779999   8494400.0
 2010-01-19  134.250000  131.559998  131.630005  134.139999  13916200.0
 2010-01-20  131.149994  128.949997  130.460007  130.250000  15197500.0
 2010-01-21  130.690002  128.059998  130.470001  129.000000   9608600.0
 2010-01-22  128.889999  125.370003  128.669998  125.500000  10088600.0
 2010-01-25  126.889999  125.709999  126.330002  126.120003   5738500.0
 2010-01-26  127.750000  125.410004  125.919998  125.750000   7135300.0
 2010-01-27  126.959999  125.040001  125.820000  126.330002   8719200.0
 2010-01-28  127.040001  123.050003  127.029999  123.750000   9622200.0
 2010-01-29  125.000000  121.900002  124.320000  122.389999  11571200.0
 2010-02-01  124.949997  122.779999  123.230003  124.669998   7242900.0
 2010-02-02  125.809998  123.949997  124.790001  125.529999   5899900.0
 2010-02-03  126.070000  125.070000  125.160004  125.660004   4177100.0
 2010-02-04  125.440002  122.900002  125.190002  123.000000   9126900.0
 2010-02-05  123.720001  121.830002  123.040001  123.519997   8617000.0
 2010-02-08  123.220001  121.739998  123.150002  121.879997   5718500.0
 2010-02-09  124.199997  122.459999  122.650002  123.209999   6044500.0
 2010-02-10  123.650002  122.209999  122.940002  122.809998   5219100.0
 2010-02-11  124.199997  122.059998  122.580002  123.730003   5089000.0
 2010-02-12  124.050003  121.610001  123.010002  124.000000   8017700.0
 ...                ...         ...         ...         ...         ...
 2019-06-21  139.539993  138.389999  138.440002  139.199997   5288700.0
 2019-06-24  140.149994  139.050003  139.199997  139.350006   2186000.0
 2019-06-25  139.550003  138.130005  139.460007  138.360001   2801200.0
 2019-06-26  139.679993  138.410004  138.869995  138.520004   2284600.0
 2019-06-27  139.300003  137.949997  138.720001  138.520004   2149800.0
 2019-06-28  139.139999  137.839996  138.570007  137.899994   6153900.0
 2019-07-01  141.490005  139.279999  139.600006  139.880005   3377700.0
 2019-07-02  140.429993  139.470001  139.750000  140.220001   2409700.0
 2019-07-03  141.820007  140.429993  140.720001  141.539993   1930400.0
 2019-07-05  141.490005  139.910004  140.869995  141.380005   2134700.0
 2019-07-08  141.289993  140.270004  141.050003  140.570007   2395300.0
 2019-07-09  140.990005  139.130005  140.610001  139.330002   3365200.0
 2019-07-10  141.910004  139.789993  140.000000  140.470001   2513900.0
 2019-07-11  141.580002  140.300003  140.789993  141.240005   2132900.0
 2019-07-12  142.919998  141.660004  141.919998  142.740005   2786200.0
 2019-07-15  143.509995  142.119995  142.889999  143.320007   2368300.0
 2019-07-16  144.039993  143.020004  143.169998  143.529999   3474700.0
 2019-07-17  143.800003  141.949997  143.610001  143.070007   6064300.0
 2019-07-18  150.309998  142.199997  142.500000  149.630005  12695400.0
 2019-07-19  151.580002  149.550003  149.960007  149.679993   7290700.0
 2019-07-22  151.940002  149.699997  150.160004  149.740005   4092600.0
 2019-07-23  150.720001  148.380005  150.570007  150.380005   3742200.0
 2019-07-24  151.449997  149.199997  150.119995  150.029999   2952400.0
 2019-07-25  150.619995  148.610001  149.820007  150.389999   3102100.0
 2019-07-26  151.410004  150.100006  151.000000  151.360001   2904300.0
 2019-07-29  151.479996  150.320007  151.110001  150.880005   2075500.0
 2019-07-30  150.399994  149.220001  150.000000  149.770004   2632700.0
 2019-07-31  150.179993  146.389999  149.699997  148.240005   3722900.0
 2019-08-01  152.820007  148.500000  148.899994  150.320007   6344000.0
 2019-08-02  152.949997  145.589996  149.029999  147.250000   8080100.0

              Adj Close
 Date
 2009-12-31   98.137283
 2010-01-04   99.299347
 2010-01-05   98.099792
 2010-01-06   97.462532
 2010-01-07   97.125160
 2010-01-08   98.099792
 2010-01-11   97.072685
 2010-01-12   97.844872
 2010-01-13   97.634964
 2010-01-14   99.194389
 2010-01-15   98.797028
 2010-01-19  100.566330
 2010-01-20   97.649979
 2010-01-21   96.712860
 2010-01-22   94.088844
 2010-01-25   94.553688
 2010-01-26   94.276276
 2010-01-27   94.711105
 2010-01-28   92.776848
 2010-01-29   91.757233
 2010-02-01   93.466576
 2010-02-02   94.111336
 2010-02-03   94.208817
 2010-02-04   92.214569
 2010-02-05   92.604401
 2010-02-08   91.783577
 2010-02-09   92.785126
 2010-02-10   92.483902
 2010-02-11   93.176750
 2010-02-12   93.380051
 ...                ...
 2019-06-21  139.199997
 2019-06-24  139.350006
 2019-06-25  138.360001
 2019-06-26  138.520004
 2019-06-27  138.520004
 2019-06-28  137.899994
 2019-07-01  139.880005
 2019-07-02  140.220001
 2019-07-03  141.539993
 2019-07-05  141.380005
 2019-07-08  140.570007
 2019-07-09  139.330002
 2019-07-10  140.470001
 2019-07-11  141.240005
 2019-07-12  142.740005
 2019-07-15  143.320007
 2019-07-16  143.529999
 2019-07-17  143.070007
 2019-07-18  149.630005
 2019-07-19  149.679993
 2019-07-22  149.740005
 2019-07-23  150.380005
 2019-07-24  150.029999
 2019-07-25  150.389999
 2019-07-26  151.360001
 2019-07-29  150.880005
 2019-07-30  149.770004
 2019-07-31  148.240005
 2019-08-01  150.320007
 2019-08-02  147.250000

 [2413 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close       Volume  \
 Date
 2009-12-31   30.990000   30.480000   30.980000   30.480000   31929700.0
 2010-01-04   31.100000   30.590000   30.620001   30.950001   38409100.0
 2010-01-05   31.100000   30.639999   30.850000   30.959999   49749600.0
 2010-01-06   31.080000   30.520000   30.879999   30.770000   58182400.0
 2010-01-07   30.700001   30.190001   30.629999   30.450001   50559700.0
 2010-01-08   30.879999   30.240000   30.280001   30.660000   51197400.0
 2010-01-11   30.760000   30.120001   30.709999   30.270000   68754700.0
 2010-01-12   30.400000   29.910000   30.150000   30.070000   65912100.0
 2010-01-13   30.520000   30.010000   30.260000   30.350000   51863500.0
 2010-01-14   31.100000   30.260000   30.309999   30.959999   63228100.0
 2010-01-15   31.240000   30.709999   31.080000   30.860001   79913200.0
 2010-01-19   31.240000   30.680000   30.750000   31.100000   46575700.0
 2010-01-20   30.940001   30.309999   30.809999   30.590000   54849500.0
 2010-01-21   30.719999   30.000000   30.610001   30.010000   73086700.0
 2010-01-22   30.200001   28.840000   30.000000   28.959999  102004600.0
 2010-01-25   29.660000   29.100000   29.240000   29.320000   63373000.0
 2010-01-26   29.850000   29.090000   29.200001   29.500000   66639900.0
 2010-01-27   29.820000   29.020000   29.350000   29.670000   63949500.0
 2010-01-28   29.870001   28.889999   29.840000   29.160000  117513700.0
 2010-01-29   29.920000   27.660000   29.900000   28.180000  193888500.0
 2010-02-01   28.480000   27.920000   28.389999   28.410000   85931100.0
 2010-02-02   28.500000   28.139999   28.370001   28.459999   54413700.0
 2010-02-03   28.790001   28.120001   28.260000   28.629999   61397900.0
 2010-02-04   28.500000   27.809999   28.379999   27.840000   77850000.0
 2010-02-05   28.280001   27.570000   28.000000   28.020000   80960100.0
 2010-02-08   28.080000   27.570000   28.010000   27.719999   52820600.0
 2010-02-09   28.340000   27.750000   27.969999   28.010000   59195800.0
 2010-02-10   28.240000   27.840000   28.030001   27.990000   48591300.0
 2010-02-11   28.400000   27.700001   27.930000   28.120001   65993700.0
 2010-02-12   28.059999   27.580000   27.809999   27.930000   81117200.0
 ...                ...         ...         ...         ...          ...
 2019-06-21  137.729996  136.460007  136.580002  136.970001   36727900.0
 2019-06-24  138.399994  137.000000  137.000000  137.779999   20628800.0
 2019-06-25  137.589996  132.729996  137.250000  133.429993   33327400.0
 2019-06-26  135.740005  133.600006  134.350006  133.929993   23657700.0
 2019-06-27  134.710007  133.509995  134.139999  134.149994   16557500.0
 2019-06-28  134.600006  133.160004  134.570007  133.960007   30043000.0
 2019-07-01  136.699997  134.970001  136.630005  135.679993   22654200.0
 2019-07-02  136.589996  135.339996  136.119995  136.580002   15237800.0
 2019-07-03  137.740005  136.289993  136.800003  137.460007   13629300.0
 2019-07-05  137.330002  135.720001  135.940002  137.059998   18141100.0
 2019-07-08  137.100006  135.369995  136.399994  136.960007   16779700.0
 2019-07-09  136.970001  135.800003  136.000000  136.460007   19953100.0
 2019-07-10  138.580002  137.020004  137.130005  137.850006   24204400.0
 2019-07-11  139.220001  137.869995  138.199997  138.399994   22327900.0
 2019-07-12  139.130005  138.009995  138.850006  138.899994   18936800.0
 2019-07-15  139.539993  138.460007  139.440002  138.899994   16651500.0
 2019-07-16  139.050003  136.520004  138.960007  137.080002   22726100.0
 2019-07-17  137.929993  136.220001  137.699997  136.270004   20211000.0
 2019-07-18  136.619995  134.669998  135.550003  136.419998   30808700.0
 2019-07-19  140.669998  136.449997  140.220001  136.619995   48992400.0
 2019-07-22  139.190002  137.330002  137.410004  138.429993   25074900.0
 2019-07-23  139.990005  138.029999  139.759995  139.289993   18034600.0
 2019-07-24  140.740005  138.850006  138.899994  140.720001   20738300.0
 2019-07-25  140.610001  139.320007  140.429993  140.190002   18356900.0
 2019-07-26  141.679993  140.300003  140.369995  141.339996   19037600.0
 2019-07-29  141.509995  139.369995  141.500000  141.029999   16605900.0
 2019-07-30  141.220001  139.800003  140.139999  140.350006   16846500.0
 2019-07-31  140.490005  135.080002  140.330002  136.270004   38598800.0
 2019-08-01  140.940002  136.929993  137.000000  138.059998   40557500.0
 2019-08-02  138.320007  135.259995  138.089996  136.899994   30199700.0

              Adj Close
 Date
 2009-12-31   24.152580
 2010-01-04   24.525019
 2010-01-05   24.532942
 2010-01-06   24.382378
 2010-01-07   24.128809
 2010-01-08   24.295214
 2010-01-11   23.986179
 2010-01-12   23.827694
 2010-01-13   24.049570
 2010-01-14   24.532942
 2010-01-15   24.453693
 2010-01-19   24.643881
 2010-01-20   24.239746
 2010-01-21   23.780155
 2010-01-22   22.948128
 2010-01-25   23.233395
 2010-01-26   23.376024
 2010-01-27   23.510740
 2010-01-28   23.106604
 2010-01-29   22.330048
 2010-02-01   22.512297
 2010-02-02   22.551926
 2010-02-03   22.686628
 2010-02-04   22.060629
 2010-02-05   22.203266
 2010-02-08   21.965540
 2010-02-09   22.195339
 2010-02-10   22.179491
 2010-02-11   22.282507
 2010-02-12   22.131947
 ...                ...
 2019-06-21  136.970001
 2019-06-24  137.779999
 2019-06-25  133.429993
 2019-06-26  133.929993
 2019-06-27  134.149994
 2019-06-28  133.960007
 2019-07-01  135.679993
 2019-07-02  136.580002
 2019-07-03  137.460007
 2019-07-05  137.059998
 2019-07-08  136.960007
 2019-07-09  136.460007
 2019-07-10  137.850006
 2019-07-11  138.399994
 2019-07-12  138.899994
 2019-07-15  138.899994
 2019-07-16  137.080002
 2019-07-17  136.270004
 2019-07-18  136.419998
 2019-07-19  136.619995
 2019-07-22  138.429993
 2019-07-23  139.289993
 2019-07-24  140.720001
 2019-07-25  140.190002
 2019-07-26  141.339996
 2019-07-29  141.029999
 2019-07-30  140.350006
 2019-07-31  136.270004
 2019-08-01  138.059998
 2019-08-02  136.899994

 [2413 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close      Volume  \
 Date
 2009-12-31   311.532288   308.832428   311.208527   308.832428   2448700.0
 2010-01-04   313.579620   310.954468   312.304413   312.204773   3927000.0
 2010-01-05   312.747742   309.609497   312.418976   310.829926   6031900.0
 2010-01-06   311.761444   302.047852   311.761444   302.994293   7987100.0
 2010-01-07   303.861053   295.218445   303.562164   295.940735  12876600.0
 2010-01-08   300.498657   293.455048   294.894653   299.885956   9483900.0
 2010-01-11   301.101410   295.910858   301.101410   299.432648  14479800.0
 2010-01-12   297.963165   292.902130   297.709106   294.137512   9742900.0
 2010-01-13   293.091431   285.878448   287.168610   292.448822  13041800.0
 2010-01-14   295.990540   290.316833   290.859772   293.823669   8511900.0
 2010-01-15   295.671753   287.940735   295.562164   288.917053  10909600.0
 2010-01-19   294.107605   287.069000   289.514832   292.712830   8665700.0
 2010-01-20   291.895905   286.570862   291.895905   289.121307   6525700.0
 2010-01-21   292.314331   285.056549   290.630646   290.401489  12662600.0
 2010-01-22   284.234619   266.431335   281.196014   273.978058  13651700.0
 2010-01-25   273.913300   266.755127   272.274445   268.991760   8872800.0
 2010-01-26   273.773834   267.143677   267.980530   270.197235   8743600.0
 2010-01-27   272.802460   266.655518   269.624390   270.037842   7958400.0
 2010-01-28   272.478668   264.309296   271.228363   266.147400   6482300.0
 2010-01-29   269.484894   261.823608   268.239563   263.980530   8311900.0
 2010-02-01   266.904572   264.159851   266.301849   265.514771   4518400.0
 2010-02-02   266.481171   262.819885   266.481171   264.568329   8223000.0
 2010-02-03   270.037842   263.128723   263.347900   269.400208   6020500.0

In [237]:
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})

In [239]:
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [240]:
all_data.items()

dict_items([('AAPL',                   High         Low        Open       Close       Volume  \
Date
2009-12-31   30.478571   30.080000   30.447144   30.104286   88102700.0
2010-01-04   30.642857   30.340000   30.490000   30.572857  123432400.0
2010-01-05   30.798571   30.464285   30.657143   30.625713  150476200.0
2010-01-06   30.747143   30.107143   30.625713   30.138571  138040000.0
2010-01-07   30.285715   29.864286   30.250000   30.082857  119282800.0
2010-01-08   30.285715   29.865715   30.042856   30.282858  111902700.0
2010-01-11   30.428572   29.778572   30.400000   30.015715  115557400.0
2010-01-12   29.967142   29.488571   29.884285   29.674286  148614900.0
2010-01-13   30.132856   29.157143   29.695715   30.092857  151473000.0
2010-01-14   30.065714   29.860001   30.015715   29.918571  108223500.0
2010-01-15   30.228571   29.410000   30.132856   29.418571  148516900.0
2010-01-19   30.741428   29.605715   29.761429   30.719999  182501900.0
2010-01-20   30.792856   29.928572   30.701429   30.247143  153038200.0
2010-01-21   30.472857   29.601429   30.297142   29.724285  152038600.0
2010-01-22   29.642857   28.165714   29.540001   28.250000  220441900.0
2010-01-25   29.242857   28.598572   28.930000   29.010000  266424900.0
2010-01-26   30.530001   28.940001   29.421429   29.420000  466777500.0
2010-01-27   30.082857   28.504286   29.549999   29.697144  430642100.0
2010-01-28   29.357143   28.385714   29.275715   28.469999  293375600.0
2010-01-29   28.885714   27.178572   28.725714   27.437143  311488100.0
2010-02-01   28.000000   27.328571   27.481428   27.818571  187469100.0
2010-02-02   28.045713   27.625713   27.987143   27.980000  174585600.0
2010-02-03   28.600000   27.774286   27.881428   28.461428  153832000.0
2010-02-04   28.338572   27.367144   28.104286   27.435715  189413000.0
2010-02-05   28.000000   27.264286   27.518572   27.922857  212576700.0
2010-02-08   28.268572   27.714285   27.955715   27.731428  119567700.0
2010-02-09   28.214285   27.821428   28.059999   28.027143  158221700.0
2010-02-10   28.085714   27.751429   27.984285   27.874287   92590400.0
2010-02-11   28.535715   27.722857   27.840000   28.381428  137586400.0
2010-02-12   28.805714   27.928572   28.301428   28.625713  163867200.0
...                ...         ...         ...         ...          ...
2019-06-21  200.850006  198.149994  198.800003  198.779999   47800600.0
2019-06-24  200.160004  198.169998  198.539993  198.580002   18220400.0
2019-06-25  199.259995  195.289993  198.429993  195.570007   21070300.0
2019-06-26  200.990005  197.350006  197.770004  199.800003   26067500.0
2019-06-27  201.570007  199.570007  200.289993  199.740005   20899700.0
2019-06-28  199.500000  197.050003  198.679993  197.919998   31110600.0
2019-07-01  204.490005  200.649994  203.169998  201.550003   27316700.0
2019-07-02  203.130005  201.360001  201.410004  202.729996   16935200.0
2019-07-03  204.440002  202.690002  203.279999  204.410004   11362000.0
2019-07-05  205.080002  202.899994  203.350006  204.229996   17265500.0
2019-07-08  201.399994  198.410004  200.809998  200.020004   25338600.0
2019-07-09  201.509995  198.809998  199.199997  201.240005   20578000.0
2019-07-10  203.729996  201.559998  201.850006  203.229996   17897100.0
2019-07-11  204.389999  201.710007  203.309998  201.750000   20191800.0
2019-07-12  204.000000  202.199997  202.449997  203.300003   17595200.0
2019-07-15  205.869995  204.000000  204.089996  205.210007   16947400.0
2019-07-16  206.110001  203.500000  204.589996  204.500000   16866800.0
2019-07-17  205.089996  203.270004  204.050003  203.350006   14107500.0
2019-07-18  205.880005  203.699997  204.000000  205.660004   18582200.0
2019-07-19  206.500000  202.360001  205.789993  202.589996   20929300.0
2019-07-22  207.229996  203.610001  203.649994  207.220001   22277900.0
2019-07-23  208.910004  207.289993  208.460007  208.839996   18355200.0
2019-07-24  209.149994  207.169998  207.669998  208.669998   14991600.0
2019-07-25  209.240005  206.729996  208.889999  207.020004   13909600.0
2019-07-26  209.729996  207.139999  207.479996  207.740005   17618900.0
2019-07-29  210.639999  208.440002  208.460007  209.679993   21673400.0
2019-07-30  210.160004  207.309998  208.759995  208.779999   33935700.0
2019-07-31  221.369995  211.300003  216.419998  213.039993   69281400.0
2019-08-01  218.029999  206.740005  213.899994  208.429993   54017900.0
2019-08-02  206.429993  201.630005  205.529999  204.020004   38688200.0

             Adj Close
Date
2009-12-31   26.372231
2010-01-04   26.782711
2010-01-05   26.829010
2010-01-06   26.402260
2010-01-07   26.353460
2010-01-08   26.528664
2010-01-11   26.294640
2010-01-12   25.995537
2010-01-13   26.362217
2010-01-14   26.209538
2010-01-15   25.771528
2010-01-19   26.911612
2010-01-20   26.497383
2010-01-21   26.039341
2010-01-22   24.747818
2010-01-25   25.413599
2010-01-26   25.772774
2010-01-27   26.015560
2010-01-28   24.940546
2010-01-29   24.035734
2010-02-01   24.369871
2010-02-02   24.511295
2010-02-03   24.933033
2010-02-04   24.034487
2010-02-05   24.461227
2010-02-08   24.293537
2010-02-09   24.552589
2010-02-10   24.418684
2010-02-11   24.862957
2010-02-12   25.076958
...                ...
2019-06-21  198.779999
2019-06-24  198.580002
2019-06-25  195.570007
2019-06-26  199.800003
2019-06-27  199.740005
2019-06-28  197.919998
2019-07-01  201.550003
2019-07-02  202.729996
2019-07-03  204.410004
2019-07-05  204.229996
2019-07-08  200.020004
2019-07-09  201.240005
2019-07-10  203.229996
2019-07-11  201.750000
2019-07-12  203.300003
2019-07-15  205.210007
2019-07-16  204.500000
2019-07-17  203.350006
2019-07-18  205.660004
2019-07-19  202.589996
2019-07-22  207.220001
2019-07-23  208.839996
2019-07-24  208.669998
2019-07-25  207.020004
2019-07-26  207.740005
2019-07-29  209.679993
2019-07-30  208.779999
2019-07-31  213.039993
2019-08-01  208.429993
2019-08-02  204.020004

[2413 rows x 6 columns]), ('IBM',                   High         Low        Open       Close      Volume  \
Date
2009-12-31  132.850006  130.750000  132.410004  130.899994   4223400.0
2010-01-04  132.970001  130.850006  131.179993  132.449997   6155300.0
2010-01-05  131.850006  130.100006  131.679993  130.850006   6841400.0
2010-01-06  131.490005  129.809998  130.679993  130.000000   5605300.0
2010-01-07  130.250000  128.910004  129.869995  129.550003   5840600.0
2010-01-08  130.919998  129.050003  129.070007  130.850006   4197200.0
2010-01-11  131.059998  128.669998  131.059998  129.479996   5730400.0
2010-01-12  131.330002  129.000000  129.029999  130.509995   8081500.0
2010-01-13  131.119995  129.160004  130.389999  130.229996   6455400.0
2010-01-14  132.710007  129.910004  130.550003  132.309998   7111800.0
2010-01-15  132.889999  131.089996  132.029999  131.779999   8494400.0
2010-01-19  134.250000  131.559998  131.630005  134.139999  13916200.0
2010-01-20  131.149994  128.949997  130.460007  130.250000  15197500.0
2010-01-21  130.690002  128.059998  130.470001  129.000000   9608600.0
2010-01-22  128.889999  125.370003  128.669998  125.500000  10088600.0
2010-01-25  126.889999  125.709999  126.330002  126.120003   5738500.0
2010-01-26  127.750000  125.410004  125.919998  125.750000   7135300.0
2010-01-27  126.959999  125.040001  125.820000  126.330002   8719200.0
2010-01-28  127.040001  123.050003  127.029999  123.750000   9622200.0
2010-01-29  125.000000  121.900002  124.320000  122.389999  11571200.0
2010-02-01  124.949997  122.779999  123.230003  124.669998   7242900.0
2010-02-02  125.809998  123.949997  124.790001  125.529999   5899900.0
2010-02-03  126.070000  125.070000  125.160004  125.660004   4177100.0
2010-02-04  125.440002  122.900002  125.190002  123.000000   9126900.0
2010-02-05  123.720001  121.830002  123.040001  123.519997   8617000.0
2010-02-08  123.220001  121.739998  123.150002  121.879997   5718500.0
2010-02-09  124.199997  122.459999  122.650002  123.209999   6044500.0
2010-02-10  123.650002  122.209999  122.940002  122.809998   5219100.0
2010-02-11  124.199997  122.059998  122.580002  123.730003   5089000.0
2010-02-12  124.050003  121.610001  123.010002  124.000000   8017700.0
...                ...         ...         ...         ...         ...
2019-06-21  139.539993  138.389999  138.440002  139.199997   5288700.0
2019-06-24  140.149994  139.050003  139.199997  139.350006   2186000.0
2019-06-25  139.550003  138.130005  139.460007  138.360001   2801200.0
2019-06-26  139.679993  138.410004  138.869995  138.520004   2284600.0
2019-06-27  139.300003  137.949997  138.720001  138.520004   2149800.0
2019-06-28  139.139999  137.839996  138.570007  137.899994   6153900.0
2019-07-01  141.490005  139.279999  139.600006  139.880005   3377700.0
2019-07-02  140.429993  139.470001  139.750000  140.220001   2409700.0
2019-07-03  141.820007  140.429993  140.720001  141.539993   1930400.0
2019-07-05  141.490005  139.910004  140.869995  141.380005   2134700.0
2019-07-08  141.289993  140.270004  141.050003  140.570007   2395300.0
2019-07-09  140.990005  139.130005  140.610001  139.330002   3365200.0
2019-07-10  141.910004  139.789993  140.000000  140.470001   2513900.0
2019-07-11  141.580002  140.300003  140.789993  141.240005   2132900.0
2019-07-12  142.919998  141.660004  141.919998  142.740005   2786200.0
2019-07-15  143.509995  142.119995  142.889999  143.320007   2368300.0
2019-07-16  144.039993  143.020004  143.169998  143.529999   3474700.0
2019-07-17  143.800003  141.949997  143.610001  143.070007   6064300.0
2019-07-18  150.309998  142.199997  142.500000  149.630005  12695400.0
2019-07-19  151.580002  149.550003  149.960007  149.679993   7290700.0
2019-07-22  151.940002  149.699997  150.160004  149.740005   4092600.0
2019-07-23  150.720001  148.380005  150.570007  150.380005   3742200.0
2019-07-24  151.449997  149.199997  150.119995  150.029999   2952400.0
2019-07-25  150.619995  148.610001  149.820007  150.389999   3102100.0
2019-07-26  151.410004  150.100006  151.000000  151.360001   2904300.0
2019-07-29  151.479996  150.320007  151.110001  150.880005   2075500.0
2019-07-30  150.399994  149.220001  150.000000  149.770004   2632700.0
2019-07-31  150.179993  146.389999  149.699997  148.240005   3722900.0
2019-08-01  152.820007  148.500000  148.899994  150.320007   6344000.0
2019-08-02  152.949997  145.589996  149.029999  147.250000   8080100.0

             Adj Close
Date
2009-12-31   98.137283
2010-01-04   99.299347
2010-01-05   98.099792
2010-01-06   97.462532
2010-01-07   97.125160
2010-01-08   98.099792
2010-01-11   97.072685
2010-01-12   97.844872
2010-01-13   97.634964
2010-01-14   99.194389
2010-01-15   98.797028
2010-01-19  100.566330
2010-01-20   97.649979
2010-01-21   96.712860
2010-01-22   94.088844
2010-01-25   94.553688
2010-01-26   94.276276
2010-01-27   94.711105
2010-01-28   92.776848
2010-01-29   91.757233
2010-02-01   93.466576
2010-02-02   94.111336
2010-02-03   94.208817
2010-02-04   92.214569
2010-02-05   92.604401
2010-02-08   91.783577
2010-02-09   92.785126
2010-02-10   92.483902
2010-02-11   93.176750
2010-02-12   93.380051
...                ...
2019-06-21  139.199997
2019-06-24  139.350006
2019-06-25  138.360001
2019-06-26  138.520004
2019-06-27  138.520004
2019-06-28  137.899994
2019-07-01  139.880005
2019-07-02  140.220001
2019-07-03  141.539993
2019-07-05  141.380005
2019-07-08  140.570007
2019-07-09  139.330002
2019-07-10  140.470001
2019-07-11  141.240005
2019-07-12  142.740005
2019-07-15  143.320007
2019-07-16  143.529999
2019-07-17  143.070007
2019-07-18  149.630005
2019-07-19  149.679993
2019-07-22  149.740005
2019-07-23  150.380005
2019-07-24  150.029999
2019-07-25  150.389999
2019-07-26  151.360001
2019-07-29  150.880005
2019-07-30  149.770004
2019-07-31  148.240005
2019-08-01  150.320007
2019-08-02  147.250000

[2413 rows x 6 columns]), ('MSFT',                   High         Low        Open       Close       Volume  \
Date
2009-12-31   30.990000   30.480000   30.980000   30.480000   31929700.0
2010-01-04   31.100000   30.590000   30.620001   30.950001   38409100.0
2010-01-05   31.100000   30.639999   30.850000   30.959999   49749600.0
2010-01-06   31.080000   30.520000   30.879999   30.770000   58182400.0
2010-01-07   30.700001   30.190001   30.629999   30.450001   50559700.0
2010-01-08   30.879999   30.240000   30.280001   30.660000   51197400.0
2010-01-11   30.760000   30.120001   30.709999   30.270000   68754700.0
2010-01-12   30.400000   29.910000   30.150000   30.070000   65912100.0
2010-01-13   30.520000   30.010000   30.260000   30.350000   51863500.0
2010-01-14   31.100000   30.260000   30.309999   30.959999   63228100.0
2010-01-15   31.240000   30.709999   31.080000   30.860001   79913200.0
2010-01-19   31.240000   30.680000   30.750000   31.100000   46575700.0
2010-01-20   30.940001   30.309999   30.809999   30.590000   54849500.0
2010-01-21   30.719999   30.000000   30.610001   30.010000   73086700.0
2010-01-22   30.200001   28.840000   30.000000   28.959999  102004600.0
2010-01-25   29.660000   29.100000   29.240000   29.320000   63373000.0
2010-01-26   29.850000   29.090000   29.200001   29.500000   66639900.0
2010-01-27   29.820000   29.020000   29.350000   29.670000   63949500.0
2010-01-28   29.870001   28.889999   29.840000   29.160000  117513700.0
2010-01-29   29.920000   27.660000   29.900000   28.180000  193888500.0
2010-02-01   28.480000   27.920000   28.389999   28.410000   85931100.0
2010-02-02   28.500000   28.139999   28.370001   28.459999   54413700.0
2010-02-03   28.790001   28.120001   28.260000   28.629999   61397900.0
2010-02-04   28.500000   27.809999   28.379999   27.840000   77850000.0
2010-02-05   28.280001   27.570000   28.000000   28.020000   80960100.0
2010-02-08   28.080000   27.570000   28.010000   27.719999   52820600.0
2010-02-09   28.340000   27.750000   27.969999   28.010000   59195800.0
2010-02-10   28.240000   27.840000   28.030001   27.990000   48591300.0
2010-02-11   28.400000   27.700001   27.930000   28.120001   65993700.0
2010-02-12   28.059999   27.580000   27.809999   27.930000   81117200.0
...                ...         ...         ...         ...          ...
2019-06-21  137.729996  136.460007  136.580002  136.970001   36727900.0
2019-06-24  138.399994  137.000000  137.000000  137.779999   20628800.0
2019-06-25  137.589996  132.729996  137.250000  133.429993   33327400.0
2019-06-26  135.740005  133.600006  134.350006  133.929993   23657700.0
2019-06-27  134.710007  133.509995  134.139999  134.149994   16557500.0
2019-06-28  134.600006  133.160004  134.570007  133.960007   30043000.0
2019-07-01  136.699997  134.970001  136.630005  135.679993   22654200.0
2019-07-02  136.589996  135.339996  136.119995  136.580002   15237800.0
2019-07-03  137.740005  136.289993  136.800003  137.460007   13629300.0
2019-07-05  137.330002  135.720001  135.940002  137.059998   18141100.0
2019-07-08  137.100006  135.369995  136.399994  136.960007   16779700.0
2019-07-09  136.970001  135.800003  136.000000  136.460007   19953100.0
2019-07-10  138.580002  137.020004  137.130005  137.850006   24204400.0
2019-07-11  139.220001  137.869995  138.199997  138.399994   22327900.0
2019-07-12  139.130005  138.009995  138.850006  138.899994   18936800.0
2019-07-15  139.539993  138.460007  139.440002  138.899994   16651500.0
2019-07-16  139.050003  136.520004  138.960007  137.080002   22726100.0
2019-07-17  137.929993  136.220001  137.699997  136.270004   20211000.0
2019-07-18  136.619995  134.669998  135.550003  136.419998   30808700.0
2019-07-19  140.669998  136.449997  140.220001  136.619995   48992400.0
2019-07-22  139.190002  137.330002  137.410004  138.429993   25074900.0
2019-07-23  139.990005  138.029999  139.759995  139.289993   18034600.0
2019-07-24  140.740005  138.850006  138.899994  140.720001   20738300.0
2019-07-25  140.610001  139.320007  140.429993  140.190002   18356900.0
2019-07-26  141.679993  140.300003  140.369995  141.339996   19037600.0
2019-07-29  141.509995  139.369995  141.500000  141.029999   16605900.0
2019-07-30  141.220001  139.800003  140.139999  140.350006   16846500.0
2019-07-31  140.490005  135.080002  140.330002  136.270004   38598800.0
2019-08-01  140.940002  136.929993  137.000000  138.059998   40557500.0
2019-08-02  138.320007  135.259995  138.089996  136.899994   30199700.0

             Adj Close
Date
2009-12-31   24.152580
2010-01-04   24.525019
2010-01-05   24.532942
2010-01-06   24.382378
2010-01-07   24.128809
2010-01-08   24.295214
2010-01-11   23.986179
2010-01-12   23.827694
2010-01-13   24.049570
2010-01-14   24.532942
2010-01-15   24.453693
2010-01-19   24.643881
2010-01-20   24.239746
2010-01-21   23.780155
2010-01-22   22.948128
2010-01-25   23.233395
2010-01-26   23.376024
2010-01-27   23.510740
2010-01-28   23.106604
2010-01-29   22.330048
2010-02-01   22.512297
2010-02-02   22.551926
2010-02-03   22.686628
2010-02-04   22.060629
2010-02-05   22.203266
2010-02-08   21.965540
2010-02-09   22.195339
2010-02-10   22.179491
2010-02-11   22.282507
2010-02-12   22.131947
...                ...
2019-06-21  136.970001
2019-06-24  137.779999
2019-06-25  133.429993
2019-06-26  133.929993
2019-06-27  134.149994
2019-06-28  133.960007
2019-07-01  135.679993
2019-07-02  136.580002
2019-07-03  137.460007
2019-07-05  137.059998
2019-07-08  136.960007
2019-07-09  136.460007
2019-07-10  137.850006
2019-07-11  138.399994
2019-07-12  138.899994
2019-07-15  138.899994
2019-07-16  137.080002
2019-07-17  136.270004
2019-07-18  136.419998
2019-07-19  136.619995
2019-07-22  138.429993
2019-07-23  139.289993
2019-07-24  140.720001
2019-07-25  140.190002
2019-07-26  141.339996
2019-07-29  141.029999
2019-07-30  140.350006
2019-07-31  136.270004
2019-08-01  138.059998
2019-08-02  136.899994

[2413 rows x 6 columns]), ('GOOG',                    High          Low         Open        Close      Volume  \
Date
2009-12-31   311.532288   308.832428   311.208527   308.832428   2448700.0
2010-01-04   313.579620   310.954468   312.304413   312.204773   3927000.0
2010-01-05   312.747742   309.609497   312.418976   310.829926   6031900.0
2010-01-06   311.761444   302.047852   311.761444   302.994293   7987100.0
2010-01-07   303.861053   295.218445   303.562164   295.940735  12876600.0
2010-01-08   300.498657   293.455048   294.894653   299.885956   9483900.0
2010-01-11   301.101410   295.910858   301.101410   299.432648  14479800.0
2010-01-12   297.963165   292.902130   297.709106   294.137512   9742900.0
2010-01-13   293.091431   285.878448   287.168610   292.448822  13041800.0
2010-01-14   295.990540   290.316833   290.859772   293.823669   8511900.0
2010-01-15   295.671753   287.940735   295.562164   288.917053  10909600.0
2010-01-19   294.107605   287.069000   289.514832   292.712830   8665700.0
2010-01-20   291.895905   286.570862   291.895905   289.121307   6525700.0
2010-01-21   292.314331   285.056549   290.630646   290.401489  12662600.0
2010-01-22   284.234619   266.431335   281.196014   273.978058  13651700.0
2010-01-25   273.913300   266.755127   272.274445   268.991760   8872800.0
2010-01-26   273.773834   267.143677   267.980530   270.197235   8743600.0
2010-01-27   272.802460   266.655518   269.624390   270.037842   7958400.0
2010-01-28   272.478668   264.309296   271.228363   266.147400   6482300.0
2010-01-29   269.484894   261.823608   268.239563   263.980530   8311900.0
2010-02-01   266.904572   264.159851   266.301849   265.514771   4518400.0
2010-02-02   266.481171   262.819885   266.481171   264.568329   8223000.0
2010-02-03   270.037842   263.128723   263.347900   269.400208   6020500.0
2010-02-04   267.995483   261.798706   267.497345   262.406433   6780600.0
2010-02-05   265.753876   260.254517   263.213409   264.653015   6335600.0
2010-02-08   269.988007   264.772552   265.255768   265.738953   5408700.0
2010-02-09   269.753906   266.535950   268.762604   267.218414   5660200.0
2010-02-10   267.890869   262.859741   266.037811   266.227112   5369000.0

In [241]:
returns = price.pct_change()

In [243]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-07-29  0.009339 -0.003171 -0.002193 -0.008797
2019-07-30 -0.004292 -0.007357 -0.004822 -0.011514
2019-07-31  0.020404 -0.010216 -0.029070 -0.006905
2019-08-01 -0.021639  0.014031  0.013136 -0.006304
2019-08-02 -0.021158 -0.020423 -0.008402 -0.012423

In [244]:
returns['MSFT'].corr(returns['IBM'])

0.48642448999988125

In [245]:
returns['MSFT'].cov(returns['IBM'])

8.633267747918666e-05

In [246]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.378498  0.451084  0.457257
IBM   0.378498  1.000000  0.486424  0.399875
MSFT  0.451084  0.486424  1.000000  0.533791
GOOG  0.457257  0.399875  0.533791  1.000000

In [247]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000265  0.000076  0.000106  0.000116
IBM   0.000076  0.000151  0.000086  0.000076
MSFT  0.000106  0.000086  0.000208  0.000120
GOOG  0.000116  0.000076  0.000120  0.000242

In [248]:
# pair wise
returns.corrwith(returns.IBM)

AAPL    0.378498
IBM     1.000000
MSFT    0.486424
GOOG    0.399875
dtype: float64

In [249]:
returns.corrwith(volume)

AAPL   -0.062038
IBM    -0.150972
MSFT   -0.090047
GOOG   -0.018750
dtype: float64

# Unique values, value counts and membership

In [250]:
obj = pd.Series(list('cadaabbcc'))
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [252]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [253]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [254]:
pd.value_counts(obj.values, sort = False)

b    2
a    3
c    3
d    1
dtype: int64

In [255]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [256]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [257]:
to_match = pd.Series(list('cabbca'))
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [258]:
unique_vals = pd.Series(list('cba'))
unique_vals

0    c
1    b
2    a
dtype: object

In [259]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [261]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                    'Qu2': [2, 3, 1, 2, 3],
                    'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [262]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0